---
title: RouteAnalysisSettings
classe: Autodesk.Revit.DB.Analysis.RouteAnalysisSettings
namespace: Autodesk.Revit.DB.Analysis
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# RouteAnalysisSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double AnalysisZoneBottomOffset { get; set; }` | `routeAnalysisSettings.AnalysisZoneBottomOffset` | Double |
| `Double AnalysisZoneTopOffset { get; set; }` | `routeAnalysisSettings.AnalysisZoneTopOffset` | Double |
| `Boolean EnableIgnoredCategoryIds { get; set; }` | `routeAnalysisSettings.EnableIgnoredCategoryIds` | Boolean |
| `Boolean IgnoreImports { get; set; }` | `routeAnalysisSettings.IgnoreImports` | Boolean |
| `Double MinimumLength { get; }` | `routeAnalysisSettings.MinimumLength` | Double |
| `ICollection<ElementId> GetExcludedCategoryIds()` | `routeAnalysisSettings.GetExcludedCategoryIds()` | ICollection<ElementId> |
| `ICollection<ElementId> GetIgnoredCategoryIds()` | `routeAnalysisSettings.GetIgnoredCategoryIds()` | ICollection<ElementId> |
| `RouteAnalysisSettings GetRouteAnalysisSettings(Document)` | `RouteAnalysisSettings.GetRouteAnalysisSettings(cda)` | RouteAnalysisSettings |
| `Boolean IsLargeGeometryAllowed()` | `routeAnalysisSettings.IsLargeGeometryAllowed()` | Boolean |
| `Void SetIgnoredCategoryIds(ICollection<ElementId>)` | `routeAnalysisSettings.SetIgnoredCategoryIds(categoryIds)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```